NlL5/esp8266_artnet_dmx512/src/main.cpp
/*
   This sketch receives Art-Net data of one DMX universes over WiFi
   and sends it to a MAX485 module as an interface between wireless
   Art-Net and wired DMX512.

   This firmware can either use the UART (aka Serial) interface to
   the MAX485 module, or the I2S interface. Note that the wiring
   depends on whether you use UART or I2S.

   See https://robertoostenveld.nl/art-net-to-dmx512-with-esp8266/
   and comments to that blog post.

   See https://github.com/robertoostenveld/esp8266_artnet_dmx512
*/

#include <ESP8266WiFi.h>         // https://github.com/esp8266/Arduino
#include <ESP8266WebServer.h>
#include <ESP8266mDNS.h>
#include <WiFiManager.h>         // https://github.com/tzapu/WiFiManager
#include <WiFiClient.h>
#include <ArtnetWifi.h>          // https://github.com/rstephan/ArtnetWifi
#include <ArduinoJson.h>
#include <FS.h>
#include <LittleFS.h>
#define SPIFFS LittleFS

#include "rgb_led.h"
#include "webinterface.h"

#define MIN(x,y) (x<y ? x : y)
#define MAX(x,y) (x>y ? x : y)

/*********************************************************************************/

// Uncomment to send DMX data using the microcontroller's builtin UART.
// This is the original way this sketch used to work and expects the max485 level
// shifter to be connected to the pin that corresponds to Serial1.
// On a Wemos D1 this is pin D4 aka TX1.
//#define ENABLE_UART

// Uncomment to send DMX data via I2S instead of UART.
// I2S allows for better control of number of stop bits and DMX timing to meet the
// requirements of sloppy devices. Moreover using DMA reduces strain of the CPU and avoids
// issues with background activity such as handling WiFi, interrupts etc.
// However - because of the extra timing/pauses for sloppy device, sending DMX over I2S
// will cause throughput to drop from approx 40 packets/s to around 30.
// On a Wemos D1 I2S is available on pin RX0.
//#define ENABLE_I2S

// Uncomment following for RGB strip
#define ENABLE_LED_STRIP

// Enable kind of unit test for new I2S code moving around a knowingly picky device
// (china brand moving head with timing issues)
//#define WITH_TEST_CODE

// Comment in to enable standalone mode. This means that the setup function won't
// block until the device was configured to connect to a Wifi network but will start
// to receive Artnet data right away on the access point network that the WifiManager
// created for this purpose. You can then simply ignore the configuration attempt and
// use the device without a local Wifi network or choose to connect one later.
// Consider setting also a password in standalone mode, otherwise someone else might
// configure your device to connect to a random Wifi.
//#define ENABLE_STANDALONE
#define STANDALONE_PASSWORD "93485oisufdg"

// Enable OTA (over the air programming in the Arduino GUI, not via the web server)
#define ENABLE_ARDUINO_OTA
#define ARDUINO_OTA_PASSWORD "$!mgboq#acPFCiWh3hgBm"

// Enable the web interface that allows to configure the ArtNet universe, the number
// of channels, etcetera
#define ENABLE_WEBINTERFACE

// Enable multicast DNS, which resolves hostnames to IP addresses within small networks
// that do not include a local name server
#define ENABLE_MDNS

/*********************************************************************************/

#ifdef ENABLE_I2S
// Reverse byte order because DMX expects LSB first but I2S sends MSB first.
byte flipByte(byte c) {
  c = ((c >> 1) & 0b01010101) | ((c << 1) & 0b10101010);
  c = ((c >> 2) & 0b00110011) | ((c << 2) & 0b11001100);
  return (c >> 4) | (c << 4);
}
#endif // ENABLE_I2S

/*********************************************************************************/

#ifdef ENABLE_UART
#include "c_types.h"
#include "eagle_soc.h"
#include "uart_register.h"
// there are two different implementations for the break, one using serial, the other using low-level timings; both should work
#define USE_SERIAL_BREAK
/* UART for DMX output */
#define SEROUT_UART 1
/* DMX minimum timings per E1.11 */
#define DMX_BREAK 92
#define DMX_MAB 12
#endif // ENABLE_UART

/*********************************************************************************/

#ifdef ENABLE_LED_STRIP
#include <NeoPixelBus.h>

unsigned long strobeStartMillis = 0;
unsigned int strobeFlashDuration = 50; // Dauer jedes Blitzes in Millisekunden
boolean strobeState = HIGH;

NeoPixelBus<NeoGrbFeature, NeoWs2812xMethod> strip(55);
#endif

/*********************************************************************************/

#ifdef ENABLE_I2S
#include <I2S.h>
#include <i2s_reg.h>
#define I2S_PIN 3
#define DMX_CHANNELS 512

// See comments below
//#define I2S_SUPER_SAFE

#ifdef I2S_SUPER_SAFE
// Below timings are based on measures taken with a commercial DMX512 controller.
// They differ substentially from the offcial DMX standard ... breaks are longer, more
// stop bits. Apparently to please some picky devices out there that cannot handle
// DMX data quickly enough.
// Using these parameters results in a throughput of approx. 29.7 packets/s (with 512 DMX channels)
typedef struct {
  uint16_t mark_before_break[10]; // 10 * 16 bits * 4 us -> 640 us
  uint16_t space_for_break[2]; // 2 * 16 bits * 4 us -> 128 us
  uint16_t mark_after_break; // 13 MSB low bits * 4 us adds 52 us to space_for_break -> 180 us
  // each "byte" (actually a word) consists of:
  // 8 bits payload + 7 stop bits (high) + 1 start (low) for the next byte
  uint16_t dmx_bytes[DMX_CHANNELS + 1];
} i2s_packet;

#else
// This configuration sets way shorter MBB and SFB but still adds lots of extra stop bits.
// At least for my devices this still works and increases thrughput slightly to 30.3  packets/s.
typedef struct {
  uint16_t mark_before_break[1]; // 1 * 16 bits * 4 us -> 64 us
  uint16_t space_for_break[1]; // 1 * 16 bits * 4 us -> 64 us
  uint16_t mark_after_break; // 13 MSB low bits * 4 us adds 52 us to space_for_break -> 116 us
  // each "byte" (actually a word) consists of:
  // 8 bits payload + 7 stop bits (high) + 1 start (low) for the next byte
  uint16_t dmx_bytes[DMX_CHANNELS + 1];
} i2s_packet;
#endif // I2S_SUPER_SAFE

