NlL5/esp8266_artnet_dmx512/src/main.cpp
#endif // ENABLE_I2S

/*********************************************************************************/

const char* host = "ARTNET";
const char* version = __DATE__ " / " __TIME__;

Config config;
ESP8266WebServer server(80);
ArtnetWifi artnet;
WiFiManager wifiManager;

// keep track of the timing of the function calls
long tic_loop = 0, tic_fps = 0, tic_packet = 0, tic_web = 0;
unsigned long packetCounter = 0, frameCounter = 0, last_packet_received = 0;
float fps = 0;

// Global buffer with one Artnet universe
struct  {
  uint16_t universeI2S;
  uint16_t universeUART;
  uint16_t length;
  uint8_t sequence;
#ifdef ENABLE_UART
  uint8_t uart_data[512];
#endif
#ifdef ENABLE_I2S
  i2s_packet i2s_data;
  uint16_t i2s_length;
#endif
#ifdef ENABLE_LED_STRIP
  uint8_t led_strip_data[512];
#endif
} global;

#ifdef ENABLE_ARDUINO_OTA
#include <ArduinoOTA.h>
// Keep track whether OTA was started
bool arduinoOtaStarted = false;
unsigned int last_ota_progress = 0;
#endif

#ifdef ENABLE_UART
long tic_uart = 0;
unsigned long uartCounter;
#endif

#ifdef ENABLE_I2S
long tic_i2s = 0;
unsigned long i2sCounter;
#endif

/*********************************************************************************/

// This will be called for each UDP packet that is received
void onDmxPacket(uint16_t universe, uint16_t length, uint8_t sequence, uint8_t * data) {

  unsigned long now = millis();
  if (now - last_packet_received > 1000) {
    Serial.print("Received DMX data\n");
  }
  last_packet_received = now;

  // print some feedback once per second
  if ((millis() - tic_fps) > 1000 && frameCounter > 100) {
    Serial.print("packetCounter = ");
    Serial.print(packetCounter++);
    // don't estimate the FPS too frequently
    fps = 1000 * frameCounter / (millis() - tic_fps);
    tic_fps = last_packet_received;
    frameCounter = 0;
    Serial.print(", FPS = ");             Serial.print(fps);
    // print out also some diagnostic info
    Serial.print(", length = ");          Serial.print(length);
    Serial.print(", sequence = ");        Serial.print(sequence);
    Serial.print(", universe = ");        Serial.print(universe);
    Serial.print(", config.universeI2S = "); Serial.print(config.universeI2S);
    Serial.print(", config.universeUART = "); Serial.print(config.universeUART);
    Serial.println();
  }

  if (universe == config.universeI2S) {
    // copy the data from the UDP packet
    global.universeI2S = universe;
    global.sequence = sequence;

#ifdef ENABLE_I2S
    // TODO optimize i2s such that it can send less than 512 bytes if not required (length<512)
    // we are sending I2S _frames_ (not bytes) and every frame consists of 2 words,
    // so we must ensure an even number of DMX values where every walue is a word

    /* do not activate before thoroughly tested with arbitrary DMX sizes
       int even_length = 2 * (length + 1) / 2;
       if (even_length > DMX_CHANNELS) {
       even_length = DMX_CHANNELS;
       }
       int skipped_bytes = 2 * (DMX_CHANNELS - even_length); // divisible by 4
       global.i2s_length = sizeof(global.i2s_data) - skipped_bytes;
       Serial.printf("length=%d, even_length=%d, skipped_bytes=%d, i2s_length=%d, sizeof(i2s_data)=%d\n",
                  length, even_length, skipped_bytes, global.i2s_length, sizeof(global.i2s_data));
    */

    for (int i = 0; i < DMX_CHANNELS; i++) {
      uint16_t hi = i < length ? flipByte(data[i]) : 0;
      // Add stop bits and start bit of next byte unless there is no next byte.
      uint16_t lo = i == DMX_CHANNELS - 1 ? 0b0000000011111111 : 0b0000000011111110;
      // leave the start-byte (index 0) untouched => +1:
      global.i2s_data.dmx_bytes[i + 1] = (hi << 8) | lo;
    }
#endif
  }

  if (universe == config.universeUART) {
    global.universeUART = universe;
    global.sequence = sequence;
#ifdef ENABLE_UART
    if (length <= 512)
      global.length = length;
    for (int i = 0; i < global.length; i++) {
      global.uart_data[i] = data[i];
    }
#endif
  }

  if (universe == config.universeUART) {
    global.universeUART = universe;
    global.sequence = sequence;
#ifdef ENABLE_LED_STRIP
    if (length <= 512)
      global.length = length;
    for (int i = 0; i < global.length; i++) {
      global.led_strip_data[i] = data[i];
    }
#endif
  }
} // onDmxpacket

/*********************************************************************************/

void setup() {

  // Serial0 is for debugging purposes
  Serial.begin(115200);
  while (!Serial) {
    ;
  }
  Serial.println("Setup starting");

  // set up three output pins for a RGB status LED
  ledInit();

#ifdef ENABLE_UART
  // Serial1 output is for DMX signalling to the MAX485 module
  Serial1.begin(250000, SERIAL_8N2);
#endif

  global.universeI2S = 0;
  global.universeUART = 0;
  global.sequence = 0;
  global.length = 512;

#ifdef ENABLE_UART
  for (int i = 0; i < 512; i++)
    global.uart_data[i] = 0;
#endif

#ifdef ENABLE_I2S
#ifdef I2S_SUPER_SAFE
  Serial.println("Using super safe I2S timing");
#else
  Serial.println("Using normal I2S timing");
#endif
  // This must NOT be called before Serial.begin I2S output is on RX0 pin
  // which would be reset to input mode for serial data rather than output for I2S data.

  pinMode(I2S_PIN, OUTPUT); // Override default Serial initiation
  digitalWrite(I2S_PIN, 1); // Set pin high

  memset(&(global.i2s_data), 0x00, sizeof(global.i2s_data));
  memset(&(global.i2s_data.mark_before_break), 0xff, sizeof(global.i2s_data.mark_before_break));

  // 3 bits (12us) MAB. The MAB's LSB 0 acts as the start bit (low) for the null byte
  global.i2s_data.mark_after_break = (uint16_t) 0b000001110;

  // Set LSB to 0 for every byte to act as the start bit of the following byte.
  // Sending 7 stop bits in stead of 2 will please slow/buggy hardware and act
  // as the mark time between slots.
  for (int i = 0; i < DMX_CHANNELS; i++) {
    global.i2s_data.dmx_bytes[i] = (uint16_t) 0b0000000011111110;
  }
  // Set MSB NOT to 0 for the last byte because MBB (mark for break will follow)
  global.i2s_data.dmx_bytes[DMX_CHANNELS] = (uint16_t) 0b0000000011111111;

  i2s_begin();
  // 250.000 baud / 32 bits = 7812
  i2s_set_rate(7812);

  // Use this to fine tune frequency: should be 125 kHz
  //memset(&data, 0b01010101, sizeof(data));
#endif

#ifdef ENABLE_LED_STRIP
    RgbColor white(128);
    RgbColor black(0);
    strip.Begin();
    strip.ClearTo(black);
    strip.SetPixelColor(0, white);
    strip.Show();
    delay(100);
    strip.SetPixelColor(0, black);
    strip.Show();
    delay(100);
    strip.SetPixelColor(0, white);
    strip.Show();
    delay(100);
    strip.SetPixelColor(0, black);
    strip.Show();
#endif

  // The LittleFS file system contains the html and javascript code for the web interface
  LittleFS.begin();

