NlL5/esp8266_artnet_dmx512/src/main.cpp
    // this section gets executed at a maximum rate of around 40Hz
    if ((millis() - tic_loop) > config.delay) {
      long now = millis();
      tic_loop = now;
      frameCounter++;

#ifdef ENABLE_UART
#ifdef USE_SERIAL_BREAK
      // switch to another baud rate, see https://forum.arduino.cc/index.php?topic=382040.0
      Serial1.flush();
      Serial1.begin(90000, SERIAL_8N2);
      while (Serial1.available()) Serial1.read();
      // send the break as a "slow" byte
      Serial1.write(0);
      // switch back to the original baud rate
      Serial1.flush();
      Serial1.begin(250000, SERIAL_8N2);
      while (Serial1.available()) Serial1.read();
#else
      // send break using low-level code
      SET_PERI_REG_MASK(UART_CONF0(SEROUT_UART), UART_TXD_BRK);
      delayMicroseconds(DMX_BREAK);
      CLEAR_PERI_REG_MASK(UART_CONF0(SEROUT_UART), UART_TXD_BRK);
      delayMicroseconds(DMX_MAB);
#endif

      Serial1.write(0); // Start-Byte
      // send out the value of the selected channels (up to 512)
      for (unsigned int i = 0; i < MIN(global.length, config.channels); i++) {
        Serial1.write(global.uart_data[i]);
      }

      uartCounter++;
      if ((now - tic_uart) > 1000 && uartCounter > 100) {
        // don't estimate the FPS too frequently
        float pps = (1000.0 * uartCounter) / (now - tic_uart);
        tic_uart = now;
        uartCounter = 0;
        Serial.printf("UART: %.1f p/s\n", pps);
      }
#endif

#ifdef ENABLE_I2S
      // From the comment in I2S.h:
      // "A frame is just a int16_t for mono, for stereo a frame is two int16_t, one for each channel."
      // Therefore we need to divide by 4 in total
      i2s_write_buffer((int16_t*) &global.i2s_data, sizeof(global.i2s_data) / 4);

      i2sCounter++;
      if ((now - tic_i2s) > 1000 && i2sCounter > 100) {
        // don't estimate the FPS too frequently
        float pps = (1000.0 * i2sCounter) / (now - tic_i2s);
        tic_i2s = now;
        i2sCounter = 0;
        Serial.printf("I2S: %.1f p/s\n", pps);
      }
#endif

#ifdef ENABLE_LED_STRIP
      // Strobe section
      if (global.led_strip_data[3] > 8) {
        unsigned long currentMillis = millis();

        uint16_t delay = 25 + 0xff - global.led_strip_data[3]; // min of 25 ms delay

        if (strobeState == HIGH && strobeStartMillis == 0) {
          // Start the strobe
          strobeStartMillis = currentMillis;
        } else if (strobeState == HIGH && currentMillis - strobeStartMillis >= strobeFlashDuration) {
          // Turn from high to low
          strobeState = LOW;
          strobeStartMillis = currentMillis;
        } else if (strobeState == LOW && currentMillis - strobeStartMillis >= delay) {
          strobeState = HIGH;
          strobeStartMillis = currentMillis;
        }
      } else {
        strobeState = HIGH;
        strobeStartMillis = 0;
      }
      
      // send out the value of the selected channels (up to 512)
      for (unsigned int i = config.led_start + 4; i < MIN(global.length, config.channels); i=i+3) {
        unsigned int pixel = (i - config.led_start + 4) / 3;

        uint8_t r = MAX(global.led_strip_data[0], global.led_strip_data[i+0]) * strobeState;
        uint8_t g = MAX(global.led_strip_data[1], global.led_strip_data[i+1]) * strobeState;
        uint8_t b = MAX(global.led_strip_data[2], global.led_strip_data[i+2]) * strobeState;

        RgbColor color(r, g, b);
        strip.SetPixelColor(pixel, color);
      }
      strip.Show();
#endif
    }
  }

#ifdef WITH_TEST_CODE
  testCode();
#endif

} // loop

/*********************************************************************************/

#ifdef WITH_TEST_CODE
void testCode() {
  long now = millis();
  uint8_t x = (now / 60) % 240;
  if (x > 120) {
    x = 240 - x;
  }

  //Serial.printf("x: %d\n", x);
#ifdef ENABLE_UART
  global.uart_data[1] =   x;// x 0 - 170
  global.uart_data[2] =   0;// x fine
  global.uart_data[3] =   x;// y: 0: -horz. 120: vert, 240: +horz
  global.uart_data[4] =   0;// y fine
  global.uart_data[5] =  30;// color wheel: red
  global.uart_data[6] =   0;// pattern
  global.uart_data[7] =   0;// strobe
  global.uart_data[8] = 150; // brightness
#endif // ENABLE_UART

#ifdef ENABLE_I2S
  global.i2s_data.dmx_bytes[1] = (flipByte(  x) << 8) | 0b0000000011111110;// x 0 - 170
  global.i2s_data.dmx_bytes[2] = (flipByte(  0) << 8) | 0b0000000011111110;// x fine
  global.i2s_data.dmx_bytes[3] = (flipByte(  x) << 8) | 0b0000000011111110;// y: 0: -horz. 120: vert, 240: +horz
  global.i2s_data.dmx_bytes[4] = (flipByte(  0) << 8) | 0b0000000011111110;// y fine
  global.i2s_data.dmx_bytes[5] = (flipByte( 30) << 8) | 0b0000000011111110; // color wheel: red
  global.i2s_data.dmx_bytes[6] = (flipByte(  0) << 8) | 0b0000000011111110;// pattern
  global.i2s_data.dmx_bytes[7] = (flipByte(  0) << 8) | 0b0000000011111110;// strobe
  global.i2s_data.dmx_bytes[8] = (flipByte(150) << 8) | 0b0000000011111110; // brightness
#endif // ENABLE_I2S
}
#endif // WITH_TEST_CODE
